//-----------------------------------------------------------------------------
//
// Copyright Colm Gavin, 2023. All rights reserved.
//
// This code is the boot image for the FPGA RISC-V processor.
// It assumes the CF card is formatted as FAT32.
// It reads "Image.bin" from the CF into the processors RAM.
//
// Thanks to http://elm-chan.org/docs/fat_e.html for explaining the FAT format.
//
//-----------------------------------------------------------------------------

/*
/ ___|(_)_ __ ___  _ __ | | ___  |  _ \(_)___  ___   \ \   / /
\___ \| | '_ ` _ \| '_ \| |/ _ \ | |_) | / __|/ __|___\ \ / / 
 ___) | | | | | | | |_) | |  __/ |  _ <| \__ \ (_|_____\ V /  
|____/|_|_| |_| |_| .__/|_|\___| |_| \_\_|___/\___|     \_/   
                  |_|                                         
  ____      _              ____             _       
 / ___|___ | |_ __ ___    / ___| __ ___   _(_)_ __  
| |   / _ \| | '_ ` _ \  | |  _ / _` \ \ / / | '_ \ 
| |__| (_) | | | | | | | | |_| | (_| |\ V /| | | | |
 \____\___/|_|_| |_| |_|  \____|\__,_| \_/ |_|_| |_|
*/

#if SIM
#include <stdio.h>
#include <stdlib.h>
#endif

typedef int bool;
#define false   0
#define true    1

#define SECTOR_SIZE	512


// These structures define the layout of the Master Boot Record

struct MbrPartition
{
	unsigned char dummy1[8];
	unsigned int  startLba;
	unsigned char dummy2[4];
};

// We need the packed attribute because unfortunately some of the fields are not alligned

struct __attribute__ ((packed)) Mbr
{
    unsigned char  jmpBoot;				// Jump instruction to the bootstrap code
    unsigned char  dummy1[10];
	unsigned short bytesPerSector;		// 11
    unsigned char  clusterSize;			// 13
	unsigned short reservedSectors;		// 14
	unsigned char  numFats;				// 16
    unsigned char  dummy2[15];
	unsigned int   totalSectors;		// 32
	unsigned short sectorsPerFat;		// 36
    unsigned char  dummy3[4];
	unsigned short fileSystemVersion;	// 42
	unsigned int   rootDirStart;		// 44
    unsigned char  dummy4[34];
    unsigned char  fileSystemType[8];	// 82 - string
	unsigned char  dummy5[356];
	struct MbrPartition partition[4];	// 446
    unsigned short bootSig;         	// 510
};


struct DirEntry
{
	unsigned char  name[11];		// 0
	unsigned char  attributes;		// 11
	unsigned char  dummy1[8];		// 12
	unsigned short highCluster;		// 20
	unsigned char  dummy2[4];		// 22
	unsigned short lowCluster;		// 26
	unsigned int   fileSize;		// 28
};


// Everything we need to know about the disk image on the CF card

struct CardInfo
{
	unsigned char sectorsPerCluster;
	unsigned int  fatClusters;
	unsigned int  startFat;
	unsigned int  startRootDir;
	unsigned int  startData;
    unsigned int  cachedSector;

    // When a sector is read in, it can be interpreted in multiple
    // ways depending on the type of the sector.

    union
    {
	    unsigned char cache[SECTOR_SIZE];   // One sector's worth of data from the CF disk
        struct Mbr mbr;
		struct DirEntry dirs[SECTOR_SIZE/sizeof(struct DirEntry)];
    };
};

// Important locations in memory

#if !SIM
volatile unsigned char *uartData     = (unsigned char *)0x10000000;
volatile unsigned char *uartCtrl     = (unsigned char *)0x10000005;
volatile unsigned char  *spiStatus   = (unsigned char *)0x12000000;
volatile unsigned char  *spiData     = (unsigned char *)0x12000001;
volatile unsigned char  *spiResponse = (unsigned char *)0x12000002;
